<?php

return [
    'groups' => [
        'system-settings' => 'إعدادات النظام',
        'users' => 'المستخدمون',
        'roles' => 'الأدوار',
        'treasuries' => 'الخزائن',
    ],
    'names' => [
        'system-settings' => [
            'view' => 'عرض إعدادات النظام',
            'update' => 'تعديل إعدادات النظام',
        ],
        'users' => [
            'view' => 'عرض المستخدمين',
            'create' => 'إنشاء المستخدمين',
            'update' => 'تعديل المستخدمين',
            'delete' => 'حذف المستخدمين',
        ],
        'roles' => [
            'view' => 'عرض الأدوار',
            'create' => 'إنشاء الأدوار',
            'update' => 'تعديل الأدوار',
            'delete' => 'حذف الأدوار',
        ],
        'treasuries' => [
            'view' => 'عرض الخزائن',
            'create' => 'إنشاء الخزائن',
            'update' => 'تعديل الخزائن',
            'delete' => 'حذف الخزائن',
        ],
    ],
];
